Revit 2027 API
OverrideGraphicSettings.CutBackgroundPatternId Property
 The ElementId of the cut face background fill pattern override. A value of InvalidElementId means no override is set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId CutBackgroundPatternId { get; }
Public ReadOnly Property CutBackgroundPatternId As ElementId
	Get
public:
property ElementId^ CutBackgroundPatternId {
	ElementId^ get ();
}
member CutBackgroundPatternId : ElementId with get
Property Value
ElementId
See Also
Reference
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace